Revit 2026 API

# PathReinforcementCreate(Document, Element, IListCurve, Boolean, ElementId, ElementId, ElementId, ElementId) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static PathReinforcement Create(
	Document document,
	Element hostElement,
	IList<Curve> curveArray,
	bool flip,
	ElementId pathReinforcementTypeId,
	ElementId rebarBarTypeId,
	ElementId startRebarHookTypeId,
	ElementId endRebarHookTypeId
)
```
```vb
Public Shared Function Create (
	document As Document,
	hostElement As Element,
	curveArray As IList(Of Curve),
	flip As Boolean,
	pathReinforcementTypeId As ElementId,
	rebarBarTypeId As ElementId,
	startRebarHookTypeId As ElementId,
	endRebarHookTypeId As ElementId
) As PathReinforcement
```
```cpp
public:
static PathReinforcement^ Create(
	Document^ document,
	Element^ hostElement,
	IList<Curve^>^ curveArray,
	bool flip,
	ElementId^ pathReinforcementTypeId,
	ElementId^ rebarBarTypeId,
	ElementId^ startRebarHookTypeId,
	ElementId^ endRebarHookTypeId
)
```
```fsharp
static member Create :
        document : Document *
        hostElement : Element *
        curveArray : IList<Curve> *
        flip : bool *
        pathReinforcementTypeId : ElementId *
        rebarBarTypeId : ElementId *
        startRebarHookTypeId : ElementId *
        endRebarHookTypeId : ElementId -> PathReinforcement
```

#### Parameters

document Document

hostElement Element

curveArray IListCurve

flip Boolean

pathReinforcementTypeId ElementId

rebarBarTypeId ElementId

startRebarHookTypeId ElementId

endRebarHookTypeId ElementId

#### Return Value

PathReinforcement

#### Reference

PathReinforcement Class

Create Overload

Autodesk.Revit.DB.Structure Namespace